{
    "name": "Making Implants",
    "author": "",
    "items": [
        {
            "alias": "Multi Ranged Cluster - Faded (Eye)",
            "item_id": 101562
        },
        {
            "alias": "Basic Eye Implant",
            "item_id": 101102
        }
    ],
    "steps": [],
    "details": [],
    "raw": "<font color=#FFFF00>------------------------------</font>\n<font color=#FF0000>A bit of Theory</font>\n<font color=#FFFF00>------------------------------</font><font color=#009B00>\n\nIn order to be efficient, The Basic Implant must be loaded with one or more Clusters. In fact, theses Basics Implants are only the support for the clusters which give the bonus. There's three kind of Clusters : Shining ones, Bright ones and finally Faded ones. Shining Clusters are the most powerful ones, Bright ones come second and Faded ones are the weakest, in theses proportions :\n</font>\n<font color=#FFFF00> Shining = Bright + Faded </font><font color=#009B00> (to equal QL).</font>\n<font color=#FFFF00> Bright = 60% of Shining </font><font color=#009B00> (to equal QL).</font>\n<font color=#FFFF00> Faded = 40% de Shining </font><font color=#009B00> (to equal QL).\n\nEvery Basic Implant have three free slots. A free slot for every kind of Clusters. Each Cluster can be fitted in only one slot and on only one specific Basic implant.\n\nFor example:\n\nthe Cluster #L \"A Faded NanoCluster of Akimbo Style\" \"101562\" can only be fitted in the Faded slot of a \"Eye\" implant (#L \"A Basic Eye Implant\" \"101102\").\n</font>\n<font color=#FFFF00>------------------------------</font>\n<font color=#FF0000>Now practical class</font>\n<font color=#FFFF00>------------------------------</font><font color=#009B00>\n\nTo combine a Cluster with an Implant (Basic or not, assuming that the targeted slot is free) you just got to find someone with enough Nano-Programming skill. If you proceed yourself to the combination, you have to pick up the cluster and Shift+Right click on the Implant.\n</font>\n<font color=#FFFF00>------------------------------</font>\n<font color=#FF0000>Things to know</font>\n<font color=#FFFF00>------------------------------</font><font color=#009B00>\n\nYou can combine a Cluster of an higher QL than the Implant, but the Cluster cannot be too low otherwise you won't be able to combine them. (tolerance : 14% for a Faded, 16% for a Bright and 18% for a Shining).\n\nCombining a Cluster with an Implant may result in a slightly higher Implant.\n\nThe QL of the Clusters combined with an Implant of a given QL are lowered or upped to this QL.\n\nYou can find there a very useful software to help you designing your Implants: #L \"Nanonanny\" \"/start http://www.timezulu.com.au/NanoNanny/\".\n\nAll the Implants are requiring some skill in Treatement, as well as a Secondary Skill (a main attribute) dependingon the all clusters fitted in the Implant.  According to this, it may be helpful to put a not so useful Cluster rather than another one, just to make this Secondary Skill deviate to a more higher main Attribute. Thus allowing you put higher QL of Implant.\n\nAnother way to solve this problem is using \"Implant Stepping\". This tactic has been modified some patches ago, now you must have your Implant Slot in the Wear panel already empty before putting a new Implant. This still allow to have a intermediary implant in one Slot upping a main Attribute as you put your final Implant in another Slot (ie : you are two point short in Psy to put your QL60 Head implant, so you use a Chest Implant QL10, with a Bright Psychic Cluster on, which give you +5 Psy). This process still request you to plan your Implant Scheme a bit more...\n\nFixers can remove Clusters from the the Implant, resulting in a Basic Implant of the same QL. Still, during the process, all the Clusters incorporated in the Implant are lost. (Done with the help of a #L \"Implant Disassembly Clinic\" \"/tell <myname> recipe 51\")"
}
